#  pandas library

<span style='font-family:XB Niloofar;font-size:17px'>
«پانداس» (Pandas)، یک کتابخانه «متن‌باز» (Open Source) با گواهینامه BSD است که کارایی بالا، ساختاری با قابلیت استفاده آسان و ابزارهای تحلیل داده برای «زبان برنامه‌نویسی پایتون» (Python Programming Language) را فراهم می‌کند. در واقع، می‌توان گفت پانداس یک کتابخانه قدرتمند برای تحلیل، «پیش‌پردازش» (PreProcessing) و «بصری‌سازی» (Visualization) داده‌ها است. گفته می‌شود که کاربران این کتابخانه از سال ۲۰۱۴ تا ۲۰۱۸، از ۵ میلیون به ۱۰ میلیون نفر افزایش پیدا کرده‌اند و اکنون دیگر این کتابخانه به ابزاری که «باید» از آن برای کارهای مربوط به «علم داده» (Data Science) در پایتون استفاده کرد، مبدل شده است. حامی مالی پروژه پانداس، سازمان غیرانتفاعی «NumFOCUS» است

<span style='font-family:XB Niloofar;font-size:17px'>
مانند نامپای برای شروع کار با پانداس باید کتابخانه آن را اضافه کرد ، توجه کنید که اگر مفسر پایتون ارور داد باید آن را از طریق powershell با ابزار pip یا  conda نصب کنید

In [1]:
import pandas as pd

In [2]:
label = ["a1","b1","c1"]
mylist = [10,20,30]

In [3]:
pd.Series(mylist,label)

a1    10
b1    20
c1    30
dtype: int64

<span style='font-family:XB Niloofar;font-size:17px'>
پانداس براساس دو datatype اصلی series و dataframe برقرار است که در ادامه به تفصیل آن ها را بررسی میکنیم :

<span style='font-family:XB Niloofar;font-size:17px'>
اگر دیتای ما دیکشنری بود خودش مستقیم به سری تبدیل میکند:

In [4]:
di = {'a':10,'b':20,'c':30}

In [5]:
pd.Series(di)

a    10
b    20
c    30
dtype: int64

<span style='font-family:XB Niloofar;font-size:17px'>
حالا میتوانیم به محتوای هر کدام از سطر ها دسترسی داشته باشیم:

In [6]:
di['a']

10

<span style='font-family:XB Niloofar;font-size:17px'>
اگر دیتای ما دیکشنری بود و خودمان بخواهیم لیبل های دیگه بزنیم ، خروجی NaN به ما میدهد ولی برعکس آن امکا پذیر است یعنی اطلاعات یک چیز جدا باشد و لیبل ها از دیکشنری باشد که همان حکم key ها را دارد .

<span style='font-family:XB Niloofar;font-size:17px'>
روی سری ها میتوانیم عملیات ریاضی انجام دهیم به شرطی که لیبل یکسان داشته باشند توجه کنید زبان پایتون به کوچک و بزرگ بودن حروف حساس است :

In [7]:
ser1 = pd.Series([4.2,5,6,7],['uk','usa','ir','japan'])

In [8]:
ser2 = pd.Series([9,1,34,90],['uk','usa','ir','japan'])

In [9]:
ser1 + ser2

uk       13.2
usa       6.0
ir       40.0
japan    97.0
dtype: float64

<span style='font-family:XB Niloofar;font-size:17px'>
حالا موردی را بررسی میکنیم که لیبل های یکسان ندارند :

In [10]:
ser1 = pd.Series([4.2,5,6,7],['uk','usa','ir','japan'])

In [11]:
ser2 = pd.Series([9,1,34,90],['uk','uSa','ir','japan'])

In [12]:
ser1 + ser2

ir       40.0
japan    97.0
uSa       NaN
uk       13.2
usa       NaN
dtype: float64

<span style='font-family:XB Niloofar;font-size:17px'>
همانطور که میبینید usa و uSa را دو لیبل حساب کرده و مقدار NaN برگردونده چون در عملیات ریاضی حساب نمی شوند

<span style='font-family:XB Niloofar;font-size:17px'>
اگر دیتای دوبعدی خواستیم درست کنیم از Dataframe استفاده میکنیم :

In [13]:
import numpy as np

In [14]:
data = np.random.randint(1,20,(4,5))

In [15]:
df = pd.DataFrame(data,['A','B','C','D'],['E','F','G','H','I'])

<span style='font-family:XB Niloofar;font-size:17px'>
در اینجا ابتدا در پارامترها دیتا را انتخاب میکنیم (که یک ماتریس رندوم هست که در سلول قبلی درست کردیم)،سپس سطرها انتخاب میشوند و بعد ستون ها

In [16]:
df

    E   F   G   H   I
A   7  19  12  12  19
B   9   5   3  11   1
C   7  14  11  19  14
D  12   1  11  17  16

<span style='font-family:XB Niloofar;font-size:17px'>
برای دسترسی به المان ها ، برعکس نامپای ابتدا باید ستون ها را انتخاب کرد سپس سطر ها .  
  
اگر نخواستیم از این الگو پیروی کنیم باید از توابع دیگر استفاده کنیم که جلوتر آن ها را بیان میکنیم

In [17]:
df['E']['A']

7

In [18]:
df[['E','G']]

    E   G
A   7  12
B   9   3
C   7  11
D  12  11

<span style='font-family:XB Niloofar;font-size:17px'>
همانطور که میبینید ، میتوانیم چند سطر و ستون را انتخاب کنیم :

<span style='font-family:XB Niloofar;font-size:17px'>
با استفاده از دستور های loc , iloc  هم میتوانیم به محتوا دسترسی داشته باشیم :

In [19]:
df.loc['A','G']

12

In [20]:
df.iloc[0,1]

19

In [21]:
df

    E   F   G   H   I
A   7  19  12  12  19
B   9   5   3  11   1
C   7  14  11  19  14
D  12   1  11  17  16

<span style='font-family:XB Niloofar;font-size:17px'>
در این توابع مثل نامپای اول سطر انتخاب میشود و سپس ستون  
  
تابع loc باید حروف سطر و ستون را گفت ولی iloc برحسب شماره میگوییم :

<span style='font-family:XB Niloofar;font-size:17px'>
میتوان یک سطر یا ستون به دیتافریم خود اضافه کنیم :

In [22]:
df['S'] = [1,1,1,1]

In [23]:
df

    E   F   G   H   I  S
A   7  19  12  12  19  1
B   9   5   3  11   1  1
C   7  14  11  19  14  1
D  12   1  11  17  16  1

<span style='font-family:XB Niloofar;font-size:17px'>
میتوان ستون یا سطر را با دستور drop پاک کنیم پارامتر axis سطرو ستون را مشخص میکند، یک یعنی ستون و صفر یعنی سطر :

In [24]:
df.drop('S',axis=1)

    E   F   G   H   I
A   7  19  12  12  19
B   9   5   3  11   1
C   7  14  11  19  14
D  12   1  11  17  16

<span style='font-family:XB Niloofar;font-size:17px'>
ولی همانطور که جلوتر میبیند پاک نشده است چون دیتا خیلی ارزشمند است با یک دستور پاک نمی شود ولی جلوتر در مورد پاک کردن دایمی آن صحبت میکنیم :

In [25]:
df

    E   F   G   H   I  S
A   7  19  12  12  19  1
B   9   5   3  11   1  1
C   7  14  11  19  14  1
D  12   1  11  17  16  1

<span style='font-family:XB Niloofar;font-size:17px'>
برای پاک کردن دایمی باید پارامتر inplace را true کرد :

In [26]:
df.drop('S',axis=1,inplace=True)

In [27]:
df

    E   F   G   H   I
A   7  19  12  12  19
B   9   5   3  11   1
C   7  14  11  19  14
D  12   1  11  17  16

<span style='font-family:XB Niloofar;font-size:17px'>
روی دیتا ها میتوان بزرگتر و کوچکتر را با True و False بررسی کرد :

In [28]:
df>10

       E      F      G     H      I
A  False   True   True  True   True
B  False  False  False  True  False
C  False   True   True  True   True
D   True  False   True  True   True

<span style='font-family:XB Niloofar;font-size:17px'>
اگر بخواهیم اعداد را ببینیم و فقط اون هایی که قابلیت رو ندارن حالت NaN داشته باشند :

In [29]:
df[df>10]

      E     F     G   H     I
A   NaN  19.0  12.0  12  19.0
B   NaN   NaN   NaN  11   NaN
C   NaN  14.0  11.0  19  14.0
D  12.0   NaN  11.0  17  16.0

<span style='font-family:XB Niloofar;font-size:17px'>
میتوان براساس یک ستون خاص آن ها را بررسی کرد :

In [30]:
df[df['E']>10]

    E  F   G   H   I
D  12  1  11  17  16

<span style='font-family:XB Niloofar;font-size:17px'>
چون فقط سطر D از 10 بزرگتر شد ، به خاطر همان بقیه حذف شدند

<span style='font-family:XB Niloofar;font-size:17px'>
حالا میخواهیم بیشتر به موضوع NaN که در بخش یادگیری ماشین خیلی کاربرد دارد بررسی کنیم :

In [32]:
tf = pd.DataFrame(
     {'A' : [1,2,np.nan],
      'B' : [np.nan,np.nan,3],
      'C' : [7,8,9]
     }
)

In [33]:
tf

     A    B  C
0  1.0  NaN  7
1  2.0  NaN  8
2  NaN  3.0  9

<span style='font-family:XB Niloofar;font-size:17px'>
اگر بخواهیم NaN ها را پیدا کنیم :

In [34]:
tf.isna()

       A      B      C
0  False   True  False
1  False   True  False
2   True  False  False

In [35]:
tf.isnull()

       A      B      C
0  False   True  False
1  False   True  False
2   True  False  False

<span style='font-family:XB Niloofar;font-size:17px'>
اگر بخواهیم تعداد NaN هارا بشمریم :

In [36]:
tf.count()

A    2
B    1
C    3
dtype: int64

<span style='font-family:XB Niloofar;font-size:17px'>
حالا بخواهیم اون ستونی که دارای NaN هست رو کامل پاک کنیم :

In [37]:
tf.dropna(axis=1)

   C
0  7
1  8
2  9

<span style='font-family:XB Niloofar;font-size:17px'>
axis سطر یا ستون را برای ما مشخص میکند ولی همانطور که جلوتر میبینید باز پاک نمیشود . همانطور که قبلا گفتیم دیتا ارزشمند است و به این راحتی ها پاک نمیشود

In [38]:
tf

     A    B  C
0  1.0  NaN  7
1  2.0  NaN  8
2  NaN  3.0  9

<span style='font-family:XB Niloofar;font-size:17px'>
میتوان براساس یک ستون بقیه را مرتب کرد فقط باید مواظب بود که فقط دیتاهای عددی مرتب میشوند و اگر حروف باشد به ما ارور میدهد :

In [39]:
data1 = pd.DataFrame(
    {
        'company' : ['google','google','microsoft','microsoft','microsoft','meta'],
        'person'  : ['Ali','Hossein','Mahdi','Hasan','Zahra','Narjes'],
        'sales'   : [150,110,300,250,400,650]
    }
      
)

In [40]:
data1.groupby('company').sum(numeric_only=True)

           sales
company
google       260
meta         650
microsoft    950

<span style='font-family:XB Niloofar;font-size:17px'>
پارامتر numeric only برای این هست که ما فقط اعداد را میخواهیم که در حالت پیش فرض False بود :

<span style='font-family:XB Niloofar;font-size:17px'>
میتوان مشخصات کلی یک دیتاست را هم پیدا کرد :

In [41]:
data1.groupby('company').describe()

          sales
          count        mean        std    min    25%    50%    75%    max
company
google      2.0  130.000000  28.284271  110.0  120.0  130.0  140.0  150.0
meta        1.0  650.000000        NaN  650.0  650.0  650.0  650.0  650.0
microsoft   3.0  316.666667  76.376262  250.0  275.0  300.0  350.0  400.0